##### Pandas
- Python library yang digunakan untuk melakukan manipulasi dan analisis data
- Library python open source
- Terdapat struktur data dan fungsi yang memudahkan untuk melakukan analisis dan manipulasi data

In [219]:
import pandas as pd 
import random

In [221]:
data_score = {
    'name' : ['Dokja Kim', 'Han Sooyoung', 'Junghyuk Yoo', 'Hamin Lee', 'Jaemin Lee'],
    'Judul komik' : ['Omniscient Reader\'s Viewpoint', 'Omniscient Reader\'s Viewpoint', 'Omniscient Reader\'s Viewpoint', 'Season of Blossom', 'Season of Blossom'],
    'Math Score' : [random.randint(60, 100) for _ in range(5)],
    'English Score' : [random.randint(60, 100) for _ in range(5)],
    'Science Score' : [random.randint(60, 100) for _ in range(5)],
}

In [222]:
data_score

{'name': ['Dokja Kim',
  'Han Sooyoung',
  'Junghyuk Yoo',
  'Hamin Lee',
  'Jaemin Lee'],
 'Judul komik': ["Omniscient Reader's Viewpoint",
  "Omniscient Reader's Viewpoint",
  "Omniscient Reader's Viewpoint",
  'Season of Blossom',
  'Season of Blossom'],
 'Math Score': [85, 78, 96, 100, 73],
 'English Score': [74, 60, 76, 92, 73],
 'Science Score': [93, 73, 99, 99, 73]}

In [223]:
pd.DataFrame(data_score)

,name,Judul komik,Math Score,English Score,Science Score
0,Dokja Kim,Omniscient Reader's Viewpoint,85,74,93
1,Han Sooyoung,Omniscient Reader's Viewpoint,78,60,73
2,Junghyuk Yoo,Omniscient Reader's Viewpoint,96,76,99
3,Hamin Lee,Season of Blossom,100,92,99
4,Jaemin Lee,Season of Blossom,73,73,73

In [224]:
# biar ez akses masukkan ke dalam variable
df_score = pd.DataFrame(data_score)

In [225]:
df_score.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           5 non-null      object
 1   Judul komik    5 non-null      object
 2   Math Score     5 non-null      int64
 3   English Score  5 non-null      int64
 4   Science Score  5 non-null      int64
dtypes: int64(3), object(2)
memory usage: 328.0+ bytes

##### Acess Dataframe

In [226]:
df_score

,name,Judul komik,Math Score,English Score,Science Score
0,Dokja Kim,Omniscient Reader's Viewpoint,85,74,93
1,Han Sooyoung,Omniscient Reader's Viewpoint,78,60,73
2,Junghyuk Yoo,Omniscient Reader's Viewpoint,96,76,99
3,Hamin Lee,Season of Blossom,100,92,99
4,Jaemin Lee,Season of Blossom,73,73,73

In [227]:
df_score['name']

0       Dokja Kim
1    Han Sooyoung
2    Junghyuk Yoo
3       Hamin Lee
4      Jaemin Lee
Name: name, dtype: object

In [232]:
df_score['Math Score']

0     85
1     78
2     96
3    100
4     73
Name: Math Score, dtype: int64

In [235]:
df_score.loc[3]

name                     Hamin Lee
Judul komik      Season of Blossom
Math Score                     100
English Score                   92
Science Score                   99
Name: 3, dtype: object

In [ ]:
filter_komik = df_score["Judul komik"] == "Omniscient Reader's Viewpoint"
#df_score["Judul komik"] == "Omniscient Reader's Viewpoint" ; outputnya True/False ; boolean

In [240]:
df_score[filter_komik]

,name,Judul komik,Math Score,English Score,Science Score
0,Dokja Kim,Omniscient Reader's Viewpoint,85,74,93
1,Han Sooyoung,Omniscient Reader's Viewpoint,78,60,73
2,Junghyuk Yoo,Omniscient Reader's Viewpoint,96,76,99

##### Menggali Informasi dari Dataframe

In [ ]:
print(df_score["Math Score"].mean())
print(df_score["English Score"].median())
print(df_score["Math Score"].max())
print(df_score["Math Score"].min())
#dst

86.4
74.0
100
73

In [245]:
df_score.describe()

       Math Score  English Score  Science Score
count    5.000000       5.000000       5.000000
mean    86.400000      75.000000      87.400000
std     11.502174      11.401754      13.371612
min     73.000000      60.000000      73.000000
25%     78.000000      73.000000      73.000000
50%     85.000000      74.000000      93.000000
75%     96.000000      76.000000      99.000000
max    100.000000      92.000000      99.000000

In [247]:
df_score.describe(include = 'object')

             name                    Judul komik
count           5                              5
unique          5                              2
top     Dokja Kim  Omniscient Reader's Viewpoint
freq            1                              3

In [ ]:
df_score.sort_values(by="name") # Mengurutkan berdasarkan nama ; dst

,name,Judul komik,Math Score,English Score,Science Score
0,Dokja Kim,Omniscient Reader's Viewpoint,85,74,93
3,Hamin Lee,Season of Blossom,100,92,99
1,Han Sooyoung,Omniscient Reader's Viewpoint,78,60,73
4,Jaemin Lee,Season of Blossom,73,73,73
2,Junghyuk Yoo,Omniscient Reader's Viewpoint,96,76,99

In [249]:
df_score.sort_values(by="Math Score", ascending=False)

,name,Judul komik,Math Score,English Score,Science Score
3,Hamin Lee,Season of Blossom,100,92,99
2,Junghyuk Yoo,Omniscient Reader's Viewpoint,96,76,99
0,Dokja Kim,Omniscient Reader's Viewpoint,85,74,93
1,Han Sooyoung,Omniscient Reader's Viewpoint,78,60,73
4,Jaemin Lee,Season of Blossom,73,73,73

In [250]:
df_score.value_counts("Judul komik")

Judul komik
Omniscient Reader's Viewpoint    3
Season of Blossom                2
Name: count, dtype: int64